{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "20"}, {"size": "1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "400"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/flatten_18/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "20"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_202/conv2d_184/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_211/conv2d_193/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_202/conv2d_184/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_203/conv2d_185/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_211/conv2d_193/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_203/conv2d_185/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_204/conv2d_186/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_204/conv2d_186/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_212/conv2d_194/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_205/conv2d_187/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/conv2d_197/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_205/conv2d_187/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_212/conv2d_194/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_206/conv2d_188/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_206/conv2d_188/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_207/conv2d_189/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_213/conv2d_195/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_207/conv2d_189/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/conv2d_197/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_208/conv2d_190/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_213/conv2d_195/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_208/conv2d_190/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_209/conv2d_191/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_209/conv2d_191/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_214/conv2d_196/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_210/conv2d_192/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_210/conv2d_192/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_214/conv2d_196/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_202/leaky_re_lu_166/LeakyRelu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_202/conv2d_184/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_202/conv2d_184/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.01}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_203/leaky_re_lu_167/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_202/leaky_re_lu_166/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_203/conv2d_185/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_203/conv2d_185/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.01}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_204/leaky_re_lu_168/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_203/leaky_re_lu_167/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_204/conv2d_186/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_204/conv2d_186/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.01}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_205/leaky_re_lu_169/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_204/leaky_re_lu_168/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_205/conv2d_187/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_205/conv2d_187/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.01}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_206/leaky_re_lu_170/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_205/leaky_re_lu_169/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_206/conv2d_188/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_206/conv2d_188/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.01}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_207/leaky_re_lu_171/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_206/leaky_re_lu_170/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_207/conv2d_189/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_207/conv2d_189/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.01}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_208/leaky_re_lu_172/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_207/leaky_re_lu_171/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_208/conv2d_190/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_208/conv2d_190/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.01}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_209/leaky_re_lu_173/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_208/leaky_re_lu_172/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_209/conv2d_191/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_209/conv2d_191/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.01}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_210/leaky_re_lu_174/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_209/leaky_re_lu_173/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_210/conv2d_192/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_210/conv2d_192/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.01}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_211/leaky_re_lu_175/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_210/leaky_re_lu_174/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_211/conv2d_193/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_211/conv2d_193/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.01}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_212/leaky_re_lu_176/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_211/leaky_re_lu_175/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_212/conv2d_194/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_212/conv2d_194/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.01}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_213/leaky_re_lu_177/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_212/leaky_re_lu_176/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_213/conv2d_195/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_213/conv2d_195/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.01}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_214/leaky_re_lu_178/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_213/leaky_re_lu_177/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_214/conv2d_196/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_214/conv2d_196/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.01}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/batch_normalization_197/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_214/leaky_re_lu_178/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/conv2d_197/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/conv2d_197/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/flatten_18/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/batch_normalization_197/FusedBatchNormV3", "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/flatten_18/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/softmax_18/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/flatten_18/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/softmax_18/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/flatten_18/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_202/conv2d_184/Conv2D_weights", "shape": [5, 5, 1, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_211/conv2d_193/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_202/conv2d_184/Conv2D_bn_offset", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_203/conv2d_185/Conv2D_weights", "shape": [3, 3, 48, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_211/conv2d_193/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_203/conv2d_185/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_204/conv2d_186/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_204/conv2d_186/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_212/conv2d_194/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_205/conv2d_187/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/conv2d_197/Conv2D_weights", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_205/conv2d_187/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_212/conv2d_194/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_206/conv2d_188/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_206/conv2d_188/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_207/conv2d_189/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_213/conv2d_195/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_207/conv2d_189/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_216/conv2d_197/Conv2D_bn_offset", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_208/conv2d_190/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_213/conv2d_195/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_208/conv2d_190/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_209/conv2d_191/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_209/conv2d_191/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_214/conv2d_196/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_210/conv2d_192/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_210/conv2d_192/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_18/sequential_215/sequential_214/conv2d_196/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}]}]}