{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "15"}, {"size": "15"}, {"size": "1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "225"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/flatten_2/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}, {"size": "15"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_24/conv2d_22/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/conv2d_32/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_24/conv2d_22/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_31/conv2d_29/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_25/conv2d_23/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_25/conv2d_23/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_26/conv2d_24/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_32/conv2d_30/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_26/conv2d_24/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/conv2d_32/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_27/conv2d_25/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_32/conv2d_30/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_27/conv2d_25/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_28/conv2d_26/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_28/conv2d_26/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_33/conv2d_31/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_29/conv2d_27/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_29/conv2d_27/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_33/conv2d_31/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_30/conv2d_28/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_30/conv2d_28/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_31/conv2d_29/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_24/leaky_re_lu_20/LeakyRelu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_24/conv2d_22/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_24/conv2d_22/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.01}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_25/leaky_re_lu_21/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_24/leaky_re_lu_20/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_25/conv2d_23/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_25/conv2d_23/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.01}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_26/leaky_re_lu_22/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_25/leaky_re_lu_21/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_26/conv2d_24/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_26/conv2d_24/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.01}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_27/leaky_re_lu_23/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_26/leaky_re_lu_22/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_27/conv2d_25/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_27/conv2d_25/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.01}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_28/leaky_re_lu_24/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_27/leaky_re_lu_23/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_28/conv2d_26/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_28/conv2d_26/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.01}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_29/leaky_re_lu_25/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_28/leaky_re_lu_24/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_29/conv2d_27/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_29/conv2d_27/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.01}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_30/leaky_re_lu_26/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_29/leaky_re_lu_25/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_30/conv2d_28/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_30/conv2d_28/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.01}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_31/leaky_re_lu_27/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_30/leaky_re_lu_26/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_31/conv2d_29/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_31/conv2d_29/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.01}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_32/leaky_re_lu_28/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_31/leaky_re_lu_27/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_32/conv2d_30/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_32/conv2d_30/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.01}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_33/leaky_re_lu_29/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_32/leaky_re_lu_28/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_33/conv2d_31/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_33/conv2d_31/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.01}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/batch_normalization_32/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_33/leaky_re_lu_29/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/conv2d_32/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/conv2d_32/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/flatten_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/batch_normalization_32/FusedBatchNormV3", "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/flatten_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/softmax_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/flatten_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/softmax_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/flatten_2/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_24/conv2d_22/Conv2D_weights", "shape": [5, 5, 1, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/conv2d_32/Conv2D_weights", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_24/conv2d_22/Conv2D_bn_offset", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_31/conv2d_29/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_25/conv2d_23/Conv2D_weights", "shape": [3, 3, 48, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_25/conv2d_23/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_26/conv2d_24/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_32/conv2d_30/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_26/conv2d_24/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_35/conv2d_32/Conv2D_bn_offset", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_27/conv2d_25/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_32/conv2d_30/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_27/conv2d_25/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_28/conv2d_26/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_28/conv2d_26/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_33/conv2d_31/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_29/conv2d_27/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_29/conv2d_27/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_33/conv2d_31/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_30/conv2d_28/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_30/conv2d_28/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net_2/sequential_34/sequential_31/conv2d_29/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}]}]}