{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "20"}, {"size": "1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "400"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "20"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential/conv2d/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/conv2d_10/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_7/conv2d_7/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_1/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_1/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_2/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_8/conv2d_8/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_2/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/conv2d_10/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_3/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_8/conv2d_8/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_3/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_4/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_4/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_9/conv2d_9/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_5/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_5/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_9/conv2d_9/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_6/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_6/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_7/conv2d_7/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential/leaky_re_lu/LeakyRelu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential/conv2d/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.01}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_1/leaky_re_lu_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential/leaky_re_lu/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_1/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_1/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.01}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_2/leaky_re_lu_2/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_1/leaky_re_lu_1/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_2/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_2/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.01}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_3/leaky_re_lu_3/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_2/leaky_re_lu_2/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_3/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_3/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.01}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_4/leaky_re_lu_4/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_3/leaky_re_lu_3/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_4/conv2d_4/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_4/conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.01}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_5/leaky_re_lu_5/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_4/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_5/conv2d_5/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_5/conv2d_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.01}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_6/leaky_re_lu_6/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_5/leaky_re_lu_5/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_6/conv2d_6/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_6/conv2d_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.01}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_7/leaky_re_lu_7/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_6/leaky_re_lu_6/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_7/conv2d_7/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_7/conv2d_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.01}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_8/leaky_re_lu_8/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_7/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_8/conv2d_8/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_8/conv2d_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.01}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_9/leaky_re_lu_9/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_8/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_9/conv2d_9/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_9/conv2d_9/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.01}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/batch_normalization_10/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_9/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/conv2d_10/Conv2D_weights", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/conv2d_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/batch_normalization_10/FusedBatchNormV3", "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/flatten/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/softmax/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential/conv2d/Conv2D_weights", "shape": [5, 5, 1, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/conv2d_10/Conv2D_weights", "shape": [1, 1, 128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential/conv2d/Conv2D_bn_offset", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_7/conv2d_7/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_1/conv2d_1/Conv2D_weights", "shape": [3, 3, 48, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_1/conv2d_1/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_2/conv2d_2/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_8/conv2d_8/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_2/conv2d_2/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_11/conv2d_10/Conv2D_bn_offset", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_3/conv2d_3/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_8/conv2d_8/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_3/conv2d_3/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_4/conv2d_4/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_4/conv2d_4/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_9/conv2d_9/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_5/conv2d_5/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_5/conv2d_5/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_9/conv2d_9/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_6/conv2d_6/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_6/conv2d_6/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/alpha_gomoku_actor_net/sequential_10/sequential_7/conv2d_7/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}]}]}